# ExternalResourceReference Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceReference Properties
ExternalResourceReference Class See Also
---
The ExternalResourceReference type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InSessionPath | The path stores the full display path which includes the server name plus the path provided by ExternalResourceServer.The path that Revit will present for user recognizing and browsing to this resource during one session of Revit.This property allows ExternalResourceServers to handle cases where the path to a resource may vary between Revit sessions. For example, if this ExternalResourceReference refers to a resource in a folder, this property can be used to store the current path of the resource. If the resource is moved to another folder later, the ExternalResourceServer could calculate the correct path for the resource from resource identification information when it is loaded and store it in this property, so that it will work correctly even if the rvt file is opened in a different location.Do not rely on this path to look up an ExternalResourceReference, as the path is neither unique nor stable. It isn't unique because multiple servers might use the same server name and display name format. It isn't stable because some servers allow renaming, and because a server might change its name at some point. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ServerId | The id of the server that Revit is expecting to provide the external resource. |
| Version | The version of the external data that was most recently loaded in Revit. |

# See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace